{"A-Pucikwar": {"name": "A-Pucikwar", "iso_code": "apq", "summary": "A-Pucikwar is an extinct language of India. It belongs to the Andamanese language family.", "population": "None", "language_status": "Extinct"}, "A’ou": {"name": "A’ou", "iso_code": "aou", "summary": "A’ou is an endangered indigenous language of China. It belongs to the Kra-Dai language family. The language is used as a first language by the elderly only. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Aari": {"name": "Aari", "iso_code": "aiw", "summary": "Aari is a stable indigenous language of Ethiopia. It belongs to the Afro-Asiatic language family. The language is used as a first language by all in the ethnic community. It is used as a language of instruction in education.", "population": "10K to 1M", "language_status": "Institutional"}, "Aasáx": {"name": "Aasáx", "iso_code": "aas", "summary": "Aasáx is a dormant language of Tanzania. It belongs to the Afro-Asiatic language family. The language is no longer used as a first language by any remaining members of the ethnic community. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Abadi": {"name": "Abadi", "iso_code": "kbt", "summary": "Abadi is a stable indigenous language of Papua New Guinea. It belongs to the Austronesian language family. The language is used as a first language by all in the ethnic community. It is used as a language of instruction in some schools.", "population": "Less than 10K", "language_status": "Stable"}, "Abai Sungai": {"name": "Abai Sungai", "iso_code": "abf", "summary": "Abai Sungai is an endangered indigenous language of Malaysia. It belongs to the Austronesian language family. Direct evidence is lacking, but the language is thought to be used as a first language by adults only. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Abanglekuo": {"name": "Abanglekuo", "iso_code": "bzy", "summary": "Abanglekuo is a stable indigenous language of Nigeria. It belongs to the Niger-Congo language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Abanyom": {"name": "Abanyom", "iso_code": "abm", "summary": "Abanyom is a stable indigenous language of Nigeria. It belongs to the Niger-Congo language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Abau": {"name": "Abau", "iso_code": "aau", "summary": "Abau is a stable indigenous language of Papua New Guinea. It belongs to the Sepik language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Abaza": {"name": "Abaza", "iso_code": "abq", "summary": "Abaza is a stable indigenous language of the Russian Federation. It belongs to the Abkhaz-Adyghe language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Abé": {"name": "Abé", "iso_code": "aba", "summary": "Abé is a stable indigenous language of Côte d’Ivoire. It belongs to the Niger-Congo language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Abenaki, Eastern": {"name": "Abenaki, Eastern", "iso_code": "aaq", "summary": "Eastern Abenaki is a dormant language of the United States. It belongs to the Algic language family. The language is no longer used as a first language by any remaining members of the ethnic community. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Abenaki, Western": {"name": "Western Abenaki", "iso_code": "abe", "summary": "Western Abenaki is an endangered indigenous language of Canada. It belongs to the Algic language family. The language is used as a first language by the elderly only. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Abidji": {"name": "Abidji", "iso_code": "abi", "summary": "Abidji is a stable indigenous language of Côte d’Ivoire. It belongs to the Niger-Congo language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Abinomn": {"name": "Abinomn", "iso_code": "bsa", "summary": "Abinomn is an endangered indigenous language of Indonesia. It is an isolate that is not known to be related to any other language. Direct evidence is lacking, but the language is thought to be used as a first language by a decreasing number of young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Abipon": {"name": "Abipon", "iso_code": "axb", "summary": "Abipon is an extinct language of Argentina. It belongs to the Guaykuruan language family.", "population": "None", "language_status": "Extinct"}, "Abishi": {"name": "Abishi", "iso_code": "pcn", "summary": "Abishi is a stable indigenous language of Nigeria. It belongs to the Niger-Congo language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Abkhaz": {"name": "Abkhaz", "iso_code": "abk", "summary": "Abkhaz is an official language in the parts of Georgia where it is spoken. It belongs to the Abkhaz-Adyghe language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is used as a language of instruction in education.", "population": "10K to 1M", "language_status": "Institutional"}, "Abom": {"name": "Abom", "iso_code": "aob", "summary": "Abom is an endangered indigenous language of Papua New Guinea. It belongs to the Trans-New Guinea language family. The language is used as a first language by the elderly only. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Abon": {"name": "Abon", "iso_code": "abo", "summary": "Abon is an endangered indigenous language of Nigeria. It belongs to the Niger-Congo language family. Direct evidence is lacking, but the language is thought to be used as a first language by a decreasing number of young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Abron": {"name": "Abron", "iso_code": "abr", "summary": "Abron is a stable indigenous language of Ghana and Côte d’Ivoire. It belongs to the Niger-Congo language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "1M to 1B", "language_status": "Stable"}, "Abu": {"name": "Abu", "iso_code": "ado", "summary": "Abu is an endangered indigenous language of Papua New Guinea. It belongs to the Ramu-Lower Sepik language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Abu’": {"name": "Abu’", "iso_code": "aah", "summary": "Abu’ is an endangered indigenous language of Papua New Guinea. It belongs to the Torricelli language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Abua": {"name": "Abua", "iso_code": "abn", "summary": "Abua is a stable indigenous language of Nigeria. It belongs to the Niger-Congo language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Abui": {"name": "Abui", "iso_code": "abz", "summary": "Abui is a stable indigenous language of Indonesia. It belongs to the Trans-New Guinea language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Abun": {"name": "Abun", "iso_code": "kgr", "summary": "Abun is an endangered indigenous language of Indonesia. It is an isolate that is not known to be related to any other language. Direct evidence is lacking, but the language is thought to be used as a first language by a decreasing number of young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Abure": {"name": "Abure", "iso_code": "abu", "summary": "Abure is a stable indigenous language of Côte d’Ivoire. It belongs to the Niger-Congo language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Abureni": {"name": "Abureni", "iso_code": "mgj", "summary": "Abureni is a stable indigenous language of Nigeria. It belongs to the Niger-Congo language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "None", "language_status": "Stable"}, "Aceh": {"name": "Aceh", "iso_code": "ace", "summary": "Aceh is an endangered indigenous language of Indonesia. It belongs to the Austronesian language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is taught as a subject of instruction in some schools.", "population": "1M to 1B", "language_status": "Endangered"}, "Achagua": {"name": "Achagua", "iso_code": "aca", "summary": "Achagua is an endangered indigenous language of Colombia. It belongs to the Maipurean language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Achang": {"name": "Achang", "iso_code": "acn", "summary": "Achang is an endangered indigenous language of China and Myanmar. It belongs to the Sino-Tibetan language family. The language is used as a first language by adults only. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Ache": {"name": "Ache", "iso_code": "yif", "summary": "Ache is an endangered indigenous language of China. It belongs to the Sino-Tibetan language family. Direct evidence is lacking, but the language is thought to be used as a first language by a decreasing number of young people. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Endangered"}, "Aché": {"name": "Aché", "iso_code": "guq", "summary": "Aché is a stable indigenous language of Paraguay. It belongs to the Tupian language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Acheron": {"name": "Acheron", "iso_code": "acz", "summary": "Acheron is a stable indigenous language of Sudan. It belongs to the Niger-Congo language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Achi": {"name": "Achi", "iso_code": "acr", "summary": "Achi is an endangered indigenous language of Guatemala. It belongs to the Mayan language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Endangered"}, "Acholi": {"name": "Acholi", "iso_code": "ach", "summary": "Acholi is a stable indigenous language of Uganda and South Sudan. It belongs to the Nilo-Saharan language family. The language is used as a first language by all in the ethnic community. It is used as a language of instruction in education.", "population": "1M to 1B", "language_status": "Institutional"}, "Achterhoeks": {"name": "Achterhoeks", "iso_code": "act", "summary": "Achterhoeks is a stable indigenous language of Netherlands. It belongs to the Indo-European language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Achuar-Shiwiar": {"name": "Achuar-Shiwiar", "iso_code": "acu", "summary": "Achuar-Shiwiar is a stable indigenous language of Ecuador and Peru. It belongs to the Jivaroan language family. The language is used as a first language by all in the ethnic community. It is taught as a subject of instruction in some schools.", "population": "Less than 10K", "language_status": "Stable"}, "Achumawi": {"name": "Achumawi", "iso_code": "acv", "summary": "Achumawi is an endangered indigenous language of the United States. It belongs to the Palaihnihan language family. The language is used as a first language by the elderly only. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Acipa, Eastern": {"name": "Acipa, Eastern", "iso_code": "acp", "summary": "Eastern Acipa is a stable indigenous language of Nigeria. It belongs to the Niger-Congo language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Acroá": {"name": "Acroá", "iso_code": "acs", "summary": "Acroá is an extinct language of Brazil. It belongs to the Jean language family.", "population": "None", "language_status": "Extinct"}, "Adai": {"name": "Adai", "iso_code": "xad", "summary": "Adai is an extinct language of the United States. It is an unclassified language.", "population": "None", "language_status": "Extinct"}, "Adamorobe Sign Language": {"name": "Adamorobe Sign Language", "iso_code": "ads", "summary": "Adamorobe Sign Language is a stable indigenous language of Ghana. It is a shared sign language. The language is used as a first language by deaf people of all ages.", "population": "None", "language_status": "Stable"}, "Adang": {"name": "Adang", "iso_code": "adn", "summary": "Adang is an endangered indigenous language of Indonesia. It belongs to the Trans-New Guinea language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Adangbe": {"name": "Adangbe", "iso_code": "adq", "summary": "Adangbe is an endangered indigenous language of Ghana and Togo. It belongs to the Niger-Congo language family. Direct evidence is lacking, but the language is thought to be used as a first language by a decreasing number of young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Adara": {"name": "Adara", "iso_code": "kad", "summary": "Adara is a stable indigenous language of Nigeria. It belongs to the Niger-Congo language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Adasen": {"name": "Adasen", "iso_code": "tiu", "summary": "Adasen is an endangered indigenous language of the Philippines. It belongs to the Austronesian language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Adele": {"name": "Adele", "iso_code": "ade", "summary": "Adele is a stable indigenous language of Togo and Ghana. It belongs to the Niger-Congo language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Adi": {"name": "Adi", "iso_code": "adi", "summary": "Adi is a stable indigenous language of India and China. It belongs to the Sino-Tibetan language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Adi, Galo": {"name": "Galo Adi", "iso_code": "adl", "summary": "Galo Adi is a stable indigenous language of India. It belongs to the Sino-Tibetan language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Adioukrou": {"name": "Adioukrou", "iso_code": "adj", "summary": "Adioukrou is a stable indigenous language of Côte d’Ivoire. It belongs to the Niger-Congo language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Adithinngithigh": {"name": "Adithinngithigh", "iso_code": "dth", "summary": "Adithinngithigh is an extinct language of Australia. It belongs to the Australian language family.", "population": "None", "language_status": "Extinct"}, "Adnyamathanha": {"name": "Adnyamathanha", "iso_code": "adt", "summary": "Adnyamathanha is an endangered indigenous language of Australia. It belongs to the Australian language family. Direct evidence is lacking, but the language is thought to be used as a first language by the elderly only. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Adonara": {"name": "Adonara", "iso_code": "adr", "summary": "Adonara is a stable indigenous language of Indonesia. It belongs to the Austronesian language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Aduge": {"name": "Aduge", "iso_code": "adu", "summary": "Aduge is an endangered indigenous language of Nigeria. It belongs to the Niger-Congo language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Adyghe": {"name": "Adyghe", "iso_code": "ady", "summary": "Adyghe is an endangered indigenous language of the Russian Federation. It belongs to the Abkhaz-Adyghe language family. The language is used as a first language by adults only. It is taught as a subject of instruction in some schools.", "population": "10K to 1M", "language_status": "Stable"}, "Adzera": {"name": "Adzera", "iso_code": "adz", "summary": "Adzera is a stable indigenous language of Papua New Guinea. It belongs to the Austronesian language family. The language is used as a first language by all in the ethnic community. It is used as a language of instruction in education.", "population": "10K to 1M", "language_status": "Institutional"}, "Aeka": {"name": "Aeka", "iso_code": "aez", "summary": "Aeka is a stable indigenous language of Papua New Guinea. It belongs to the Trans-New Guinea language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Aekyom": {"name": "Aekyom", "iso_code": "awi", "summary": "Aekyom is a stable indigenous language of Papua New Guinea. It belongs to the Trans-New Guinea language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Aer": {"name": "Aer", "iso_code": "aeq", "summary": "Aer is an endangered indigenous language of Pakistan. It belongs to the Indo-European language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Afade": {"name": "Afade", "iso_code": "aal", "summary": "Afade is an endangered indigenous language of Cameroon and Nigeria. It belongs to the Afro-Asiatic language family. Direct evidence is lacking, but the language is thought to be used as a first language by a decreasing number of young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Afar": {"name": "Afar", "iso_code": "aar", "summary": "Afar is an official language in the parts of Ethiopia where it is spoken. It belongs to the Afro-Asiatic language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is used as a language of instruction in education.", "population": "1M to 1B", "language_status": "Institutional"}, "Afghan Sign Language": {"name": "Afghan Sign Language", "iso_code": "afg", "summary": "Afghan Sign Language is a stable indigenous language of Afghanistan. It is a deaf community sign language. The language is used as a first language by deaf people of all ages.", "population": "10K to 1M", "language_status": "Stable"}, "Afitti": {"name": "Afitti", "iso_code": "aft", "summary": "Afitti is an endangered indigenous language of Sudan. It belongs to the Nilo-Saharan language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Afrikaans": {"name": "Afrikaans", "iso_code": "afr", "summary": "Afrikaans is an official national language of South Africa. It belongs to the Indo-European language family. It is used as a language of instruction in education.", "population": "1M to 1B", "language_status": "Institutional"}, "Afro-Seminole Creole": {"name": "Afro-Seminole Creole", "iso_code": "afs", "summary": "Afro-Seminole Creole is an endangered indigenous language of Mexico. It is an English-based creole. The language is used as a first language by older adults only. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Agarabi": {"name": "Agarabi", "iso_code": "agd", "summary": "Agarabi is a stable indigenous language of Papua New Guinea. It belongs to the Trans-New Guinea language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Agariya": {"name": "Agariya", "iso_code": "agi", "summary": "Agariya is a stable indigenous language of India. It belongs to the Austro-Asiatic language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Agatu": {"name": "Agatu", "iso_code": "agc", "summary": "Agatu is a stable indigenous language of Nigeria. It belongs to the Niger-Congo language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Agavotaguerra": {"name": "Agavotaguerra", "iso_code": "avo", "summary": "Agavotaguerra is an extinct language of Brazil. It is an unclassified language.", "population": "None", "language_status": "Extinct"}, "Aghem": {"name": "Aghem", "iso_code": "agq", "summary": "Aghem is a stable indigenous language of Cameroon. It belongs to the Niger-Congo language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Aghu": {"name": "Aghu", "iso_code": "ahh", "summary": "Aghu is an endangered indigenous language of Indonesia. It belongs to the Trans-New Guinea language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Aghu-Tharnggala": {"name": "Aghu-Tharnggala", "iso_code": "gtu", "summary": "Aghu-Tharnggala is an extinct language of Australia. It belongs to the Australian language family.", "population": "None", "language_status": "Extinct"}, "Aghul": {"name": "Aghul", "iso_code": "agx", "summary": "Aghul is a stable indigenous language of the Russian Federation. It belongs to the Nakh-Daghestanian language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Agi": {"name": "Agi", "iso_code": "aif", "summary": "Agi is a stable indigenous language of Papua New Guinea. It belongs to the Torricelli language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Agob": {"name": "Agob", "iso_code": "kit", "summary": "Agob is a stable indigenous language of Papua New Guinea. It belongs to the South-Central Papuan language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Agta, Casiguran Dumagat": {"name": "Casiguran Dumagat Agta", "iso_code": "dgc", "summary": "Casiguran Dumagat Agta is a stable indigenous language of the Philippines. It belongs to the Austronesian language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Agta, Central Cagayan": {"name": "Central Cagayan Agta", "iso_code": "agt", "summary": "Central Cagayan Agta is a stable indigenous language of the Philippines. It belongs to the Austronesian language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Agta, Dicamay": {"name": "Agta, Dicamay", "iso_code": "duy", "summary": "Dicamay Agta is an extinct language of the Philippines. It belongs to the Austronesian language family.", "population": "None", "language_status": "Extinct"}, "Agta, Dupaninan": {"name": "Agta, Dupaninan", "iso_code": "duo", "summary": "Dupaninan Agta is an endangered indigenous language of the Philippines. It belongs to the Austronesian language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Agta, Katubung": {"name": "Agta, Katubung", "iso_code": "agk", "summary": "Katubung Agta is an endangered indigenous language of the Philippines. It belongs to the Austronesian language family. Direct evidence is lacking, but the language is thought to be used as a first language by the elderly only. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Agta, Mt. Iraya": {"name": "Agta, Mt. Iraya", "iso_code": "atl", "summary": "Mt. Iraya Agta is an endangered indigenous language of the Philippines. It belongs to the Austronesian language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Agta, Mt. Iriga": {"name": "Agta, Mt. Iriga", "iso_code": "agz", "summary": "Mt. Iriga Agta is an endangered indigenous language of the Philippines. It belongs to the Austronesian language family. Direct evidence is lacking, but the language is thought to be used as a first language by a decreasing number of young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Agta, Pahanan": {"name": "Pahanan Agta", "iso_code": "apf", "summary": "Pahanan Agta is a stable indigenous language of the Philippines. It belongs to the Austronesian language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Agta, Umiray Dumaget": {"name": "Umiray Dumaget Agta", "iso_code": "due", "summary": "Umiray Dumaget Agta is an endangered indigenous language of the Philippines. It belongs to the Austronesian language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is used as a language of instruction in some schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Agta, Villa Viciosa": {"name": "Agta, Villa Viciosa", "iso_code": "dyg", "summary": "Villa Viciosa Agta is an extinct language of the Philippines. It belongs to the Austronesian language family.", "population": "None", "language_status": "Extinct"}, "Aguano": {"name": "Aguano", "iso_code": "aga", "summary": "Aguano is an extinct language of Peru. It is an unclassified language.", "population": "None", "language_status": "Extinct"}, "Aguna": {"name": "Aguna", "iso_code": "aug", "summary": "Aguna is a stable indigenous language of Benin and Togo. It belongs to the Niger-Congo language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Agutaynen": {"name": "Agutaynen", "iso_code": "agn", "summary": "Agutaynen is a stable indigenous language of the Philippines. It belongs to the Austronesian language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Agwagwune": {"name": "Agwagwune", "iso_code": "yay", "summary": "Agwagwune is a stable indigenous language of Nigeria. It belongs to the Niger-Congo language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Ahanta": {"name": "Ahanta", "iso_code": "aha", "summary": "Ahanta is a stable indigenous language of Ghana. It belongs to the Niger-Congo language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Aheu": {"name": "Aheu", "iso_code": "thm", "summary": "Aheu is an endangered indigenous language of Thailand. It belongs to the Austro-Asiatic language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Ahirani": {"name": "Ahirani", "iso_code": "ahr", "summary": "Ahirani is a stable indigenous language of India. It belongs to the Indo-European language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "1M to 1B", "language_status": "Stable"}, "Ahom": {"name": "Ahom", "iso_code": "aho", "summary": "Ahom is a language of India that is used only as a second language and has no ethnic community. It belongs to the Kra-Dai language family. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Ahtena": {"name": "Ahtena", "iso_code": "aht", "summary": "Ahtena is an endangered indigenous language of the United States. It belongs to the Eyak-Athabaskan language family. The language is used as a first language by older adults only. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Ahwai": {"name": "Ahwai", "iso_code": "nfd", "summary": "Ahwai is a stable indigenous language of Nigeria. It belongs to the Niger-Congo language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Ai-Cham": {"name": "Ai-Cham", "iso_code": "aih", "summary": "Ai-Cham is an endangered indigenous language of China. It belongs to the Kra-Dai language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Aighon": {"name": "Aighon", "iso_code": "aix", "summary": "Aighon is a stable indigenous language of Papua New Guinea. It belongs to the Austronesian language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Aikanã": {"name": "Aikanã", "iso_code": "tba", "summary": "Aikanã is an endangered indigenous language of Brazil. It is an isolate that is not known to be related to any other language. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Aiklep": {"name": "Aiklep", "iso_code": "mwg", "summary": "Aiklep is a stable indigenous language of Papua New Guinea. It belongs to the Austronesian language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Aimaq": {"name": "Aimaq", "iso_code": "aiq", "summary": "Aimaq is a stable indigenous language of Afghanistan. It belongs to the Indo-European language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "1M to 1B", "language_status": "Stable"}, "Aimol": {"name": "Aimol", "iso_code": "aim", "summary": "Aimol is an endangered indigenous language of India. It belongs to the Sino-Tibetan language family. Direct evidence is lacking, but the language is thought to be used as a first language by a decreasing number of young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Ainbai": {"name": "Ainbai", "iso_code": "aic", "summary": "Ainbai is an endangered indigenous language of Papua New Guinea. It belongs to the Border language family. Direct evidence is lacking, but the language is thought to be used as a first language by older adults only. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Ainu": {"name": "Ainu", "iso_code": "ain", "summary": "Ainu is an endangered indigenous language of Japan. It is an isolate that is not known to be related to any other language. The language is used as a first language by the elderly only. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Aiome": {"name": "Aiome", "iso_code": "aki", "summary": "Aiome is a stable indigenous language of Papua New Guinea. It belongs to the Ramu-Lower Sepik language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Airoran": {"name": "Airoran", "iso_code": "air", "summary": "Airoran is an endangered indigenous language of Indonesia. It belongs to the Tor-Kwerba language family. Direct evidence is lacking, but the language is thought to be used as a first language by a decreasing number of young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Aisi": {"name": "Aisi", "iso_code": "mmq", "summary": "Aisi is an endangered indigenous language of Papua New Guinea. It belongs to the Trans-New Guinea language family. The language is used as a first language by adults only. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Aiton": {"name": "Aiton", "iso_code": "aio", "summary": "Aiton is an endangered indigenous language of India. It belongs to the Kra-Dai language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Aizi, Aproumu": {"name": "Aizi, Aproumu", "iso_code": "ahp", "summary": "Aproumu Aizi is an endangered indigenous language of Côte d’Ivoire. It belongs to the Niger-Congo language family. The language is used as a first language by adults only. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Aizi, Mobumrin": {"name": "Aizi, Mobumrin", "iso_code": "ahm", "summary": "Mobumrin Aizi is an endangered indigenous language of Côte d’Ivoire. It belongs to the Niger-Congo language family. Direct evidence is lacking, but the language is thought to be used as a first language by adults only. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Aizi, Tiagbamrin": {"name": "Aizi, Tiagbamrin", "iso_code": "ahi", "summary": "Tiagbamrin Aizi is a stable indigenous language of Côte d’Ivoire. It belongs to the Niger-Congo language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Aja": {"name": "Aja", "iso_code": "ajg", "summary": "Aja is a stable indigenous language of Benin and Togo. It belongs to the Niger-Congo language family. The language is used as a first language by all in the ethnic community. It is taught as a subject of instruction in some schools.", "population": "1M to 1B", "language_status": "Stable"}, "Ajawa": {"name": "Ajawa", "iso_code": "ajw", "summary": "Ajawa is an extinct language of Nigeria. It belongs to the Afro-Asiatic language family.", "population": "None", "language_status": "Extinct"}, "Ajië": {"name": "Ajië", "iso_code": "aji", "summary": "Ajië is a stable indigenous language of New Caledonia. It belongs to the Austronesian language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Ajiri": {"name": "Ajiri", "iso_code": "afo", "summary": "Ajiri is an endangered indigenous language of Nigeria. It belongs to the Niger-Congo language family. The language is used as a first language by some people in every generation of the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Endangered"}, "Ajiya": {"name": "Ajiya", "iso_code": "idc", "summary": "Ajiya is a stable indigenous language of Nigeria. It belongs to the Niger-Congo language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Ajumbu": {"name": "Ajumbu", "iso_code": "muc", "summary": "Ajumbu is an endangered indigenous language of Cameroon. It belongs to the Niger-Congo language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Ajyíninka Apurucayali": {"name": "Ajyíninka Apurucayali", "iso_code": "cpc", "summary": "Ajyíninka Apurucayali is an endangered indigenous language of Peru. It belongs to the Maipurean language family. Direct evidence is lacking, but the language is thought to be used as a first language by a decreasing number of young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Ak": {"name": "Ak", "iso_code": "akq", "summary": "Ak is an endangered indigenous language of Papua New Guinea. It belongs to the Sepik language family. The language is used as a first language by the elderly only. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Aka": {"name": "Aka", "iso_code": "soh", "summary": "Aka is an endangered indigenous language of Sudan. It belongs to the Nilo-Saharan language family. Direct evidence is lacking, but the language is thought to be used as a first language by older adults only. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Aka-Bea": {"name": "Aka-Bea", "iso_code": "abj", "summary": "Aka-Bea is an extinct language of India. It belongs to the Andamanese language family.", "population": "None", "language_status": "Extinct"}, "Aka-Bo": {"name": "Aka-Bo", "iso_code": "akm", "summary": "Aka-Bo is an extinct language of India. It belongs to the Andamanese language family.", "population": "None", "language_status": "Extinct"}, "Aka-Cari": {"name": "Aka-Cari", "iso_code": "aci", "summary": "Aka-Cari is an extinct language of India. It belongs to the Andamanese language family.", "population": "None", "language_status": "Extinct"}, "Aka-Jeru": {"name": "Aka-Jeru", "iso_code": "akj", "summary": "Aka-Jeru is an endangered indigenous language of India. It belongs to the Andamanese language family. The language is used as a first language by the elderly only. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Aka-Kede": {"name": "Aka-Kede", "iso_code": "akx", "summary": "Aka-Kede is an extinct language of India. It belongs to the Andamanese language family.", "population": "None", "language_status": "Extinct"}, "Aka-Kol": {"name": "Aka-Kol", "iso_code": "aky", "summary": "Aka-Kol is an extinct language of India. It belongs to the Andamanese language family.", "population": "None", "language_status": "Extinct"}, "Aka-Kora": {"name": "Aka-Kora", "iso_code": "ack", "summary": "Aka-Kora is an extinct language of India. It belongs to the Andamanese language family.", "population": "None", "language_status": "Extinct"}, "Akan": {"name": "Akan", "iso_code": "aka", "summary": "Akan is a language of wider communication that originated in Ghana. It belongs to the Niger-Congo language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is used as a language of instruction in education.", "population": "1M to 1B", "language_status": "Institutional"}, "Akar-Bale": {"name": "Akar-Bale", "iso_code": "acl", "summary": "Akar-Bale is an extinct language of India. It belongs to the Andamanese language family.", "population": "None", "language_status": "Extinct"}, "Akaselem": {"name": "Akaselem", "iso_code": "aks", "summary": "Akaselem is a stable indigenous language of Togo. It belongs to the Niger-Congo language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Akateko": {"name": "Akateko", "iso_code": "knj", "summary": "Akateko is a stable indigenous language of Guatemala and Mexico. It belongs to the Mayan language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Akawaio": {"name": "Akawaio", "iso_code": "ake", "summary": "Akawaio is an endangered indigenous language of Guyana, Brazil, and Venezuela. It belongs to the Cariban language family. Direct evidence is lacking, but the language is thought to be used as a first language by a decreasing number of young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Akebu": {"name": "Akebu", "iso_code": "keu", "summary": "Akebu is a stable indigenous language of Togo. It belongs to the Niger-Congo language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Akei": {"name": "Akei", "iso_code": "tsr", "summary": "Akei is a stable indigenous language of Vanuatu. It belongs to the Austronesian language family. The language is used as a first language by all in the ethnic community. It is used as a language of instruction in some schools.", "population": "10K to 1M", "language_status": "Stable"}, "Akeu": {"name": "Akeu", "iso_code": "aeu", "summary": "Akeu is a stable indigenous language of China. It belongs to the Sino-Tibetan language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Akha": {"name": "Akha", "iso_code": "ahk", "summary": "Akha is a stable indigenous language of China, Laos, Myanmar, and Thailand. It belongs to the Sino-Tibetan language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Institutional"}, "Akhvakh": {"name": "Akhvakh", "iso_code": "akv", "summary": "Akhvakh is an endangered indigenous language of the Russian Federation. It belongs to the Nakh-Daghestanian language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Aklanon": {"name": "Aklanon", "iso_code": "akl", "summary": "Aklanon is a stable indigenous language of the Philippines. It belongs to the Austronesian language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is used as a language of instruction in education.", "population": "10K to 1M", "language_status": "Institutional"}, "Akolet": {"name": "Akolet", "iso_code": "akt", "summary": "Akolet is a stable indigenous language of Papua New Guinea. It belongs to the Austronesian language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Akoose": {"name": "Akoose", "iso_code": "bss", "summary": "Akoose is a stable indigenous language of Cameroon. It belongs to the Niger-Congo language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Akoye": {"name": "Akoye", "iso_code": "miw", "summary": "Akoye is an endangered indigenous language of Papua New Guinea. It belongs to the Trans-New Guinea language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Akpes": {"name": "Akpes", "iso_code": "ibe", "summary": "Akpes is a stable indigenous language of Nigeria. It belongs to the Niger-Congo language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Akukem": {"name": "Akukem", "iso_code": "spm", "summary": "Akukem is an endangered indigenous language of Papua New Guinea. It belongs to the Ramu-Lower Sepik language family. The language is used as a first language by some people in every generation of the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Akuku": {"name": "Akuku", "iso_code": "ayk", "summary": "Akuku is a stable indigenous language of Nigeria. It belongs to the Niger-Congo language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Akum": {"name": "Akum", "iso_code": "aku", "summary": "Akum is a stable indigenous language of Cameroon and Nigeria. It belongs to the Niger-Congo language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Akuntsu": {"name": "Akuntsu", "iso_code": "aqz", "summary": "Akuntsu is an endangered indigenous language of Brazil. It belongs to the Tupian language family. Direct evidence is lacking, but the language is thought to be used as a first language by the elderly only. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Akurio": {"name": "Akurio", "iso_code": "ako", "summary": "Akurio is a dormant language of Suriname. It belongs to the Cariban language family. The language is no longer used as a first language by any remaining members of the ethnic community. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Akwa": {"name": "Akwa", "iso_code": "akw", "summary": "Akwa is an endangered indigenous language of Congo. It belongs to the Niger-Congo language family. Direct evidence is lacking, but the language is thought to be used as a first language by a decreasing number of young people. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Endangered"}, "Akweya": {"name": "Akweya", "iso_code": "akf", "summary": "Akweya is a stable indigenous language of Nigeria. It belongs to the Niger-Congo language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Akye": {"name": "Akye", "iso_code": "aik", "summary": "Akye is an endangered indigenous language of Nigeria. It belongs to the Niger-Congo language family. The language is used as a first language by some people in every generation of the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Al-Sayyid Bedouin Sign Language": {"name": "Al-Sayyid Bedouin Sign Language", "iso_code": "syy", "summary": "Al-Sayyid Bedouin Sign Language is a stable indigenous language of Israel. It is a shared sign language. The language is used as a first language by deaf people of all ages.", "population": "Less than 10K", "language_status": "Stable"}, "Alaba-K’abeena": {"name": "Alaba-K’abeena", "iso_code": "alw", "summary": "Alaba-K’abeena is a stable indigenous language of Ethiopia. It belongs to the Afro-Asiatic language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is taught as a subject of instruction in some schools.", "population": "10K to 1M", "language_status": "Stable"}, "Alabama": {"name": "Alabama", "iso_code": "akz", "summary": "Alabama is an endangered indigenous language of the United States. It belongs to the Muskogean language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Alago": {"name": "Alago", "iso_code": "ala", "summary": "Alago is a stable indigenous language of Nigeria. It belongs to the Niger-Congo language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Alagwa": {"name": "Alagwa", "iso_code": "wbj", "summary": "Alagwa is an endangered indigenous language of Tanzania. It belongs to the Afro-Asiatic language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Endangered"}, "Alak": {"name": "Alak", "iso_code": "alk", "summary": "Alak is a stable indigenous language of Laos. It belongs to the Austro-Asiatic language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Alamblak": {}, "Alangan": {"name": "Alangan", "iso_code": "alj", "summary": "Alangan is an endangered indigenous language of the Philippines. It belongs to the Austronesian language family. Direct evidence is lacking, but the language is thought to be used as a first language by a decreasing number of young people. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Endangered"}, "Alapmunte": {"name": "Alapmunte", "iso_code": "apv", "summary": "Alapmunte is an extinct language of Brazil. It belongs to the Nambikwara language family.", "population": "None", "language_status": "Extinct"}, "Alawa": {"name": "Alawa", "iso_code": "alh", "summary": "Alawa is an endangered indigenous language of Australia. It belongs to the Australian language family. The language is used as a first language by the elderly only. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Albanian": {"name": "Albanian", "iso_code": "sqi", "summary": "Albanian is classified as a “macrolanguage” in the ISO 639 standard and is assigned to [sqi] as its three-letter code. Macrolanguages were introduced into the standard in order to reconcile the fact that in some usage contexts the entity represented by the three-letter code is deemed to be a single language, while in other usage contexts it is subdivided into two or more individual languages, each of which has its own code. The individual languages that make up this macrolanguage are listed below.", "language_status": "Unknown"}, "Albanian Sign Language": {"name": "Albanian Sign Language", "iso_code": "sqk", "summary": "Albanian Sign Language is a stable indigenous language of Albania. It is a deaf community sign language. The language is used as a first language by deaf people of all ages.", "population": "Less than 10K", "language_status": "Stable"}, "Albanian, Arbëreshë": {"name": "Arbëreshë Albanian", "iso_code": "aae", "summary": "Arbëreshë Albanian is an endangered indigenous language of Italy. It belongs to the Indo-European language family and is part of the Albanian macrolanguage. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Endangered"}, "Albanian, Arvanitika": {"name": "Arvanitika Albanian", "iso_code": "aat", "summary": "Arvanitika Albanian is an endangered indigenous language of Greece. It belongs to the Indo-European language family and is part of the Albanian macrolanguage. The language is used as a first language by older adults only. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Endangered"}, "Albanian, Gheg": {"name": "Gheg Albanian", "iso_code": "aln", "summary": "Gheg Albanian is a stable indigenous language of Albania, Montenegro, North Macedonia, and Serbia. It belongs to the Indo-European language family and is part of the Albanian macrolanguage. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is used as a language of instruction in education.", "population": "1M to 1B", "language_status": "Institutional"}, "Albanian, Tosk": {"name": "Tosk Albanian", "iso_code": "als", "summary": "Tosk Albanian is the official national language of Albania. It belongs to the Indo-European language family and is part of the Albanian macrolanguage. It is used as a language of instruction in education.", "population": "1M to 1B", "language_status": "Institutional"}, "Albarradas Sign Language": {"name": "Albarradas Sign Language", "iso_code": "lsc", "summary": "Albarradas Sign Language is a stable indigenous language of Mexico. It is a shared sign language. The language is used as a first language by deaf people of all ages.", "population": "None", "language_status": "Stable"}, "Ale": {"name": "Ale", "iso_code": "gwd", "summary": "Ale is a stable indigenous language of Ethiopia. It belongs to the Afro-Asiatic language family. The language is used as a first language by all in the ethnic community. It is used as a language of instruction in education.", "population": "10K to 1M", "language_status": "Institutional"}, "Alekano": {"name": "Alekano", "iso_code": "gah", "summary": "Alekano is an endangered indigenous language of Papua New Guinea. It belongs to the Trans-New Guinea language family. The language is used as a first language by adults only. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Endangered"}, "Aleut": {"name": "Aleut", "iso_code": "ale", "summary": "Aleut is an endangered indigenous language of the United States. It belongs to the Eskimo-Aleut language family. Direct evidence is lacking, but the language is thought to be used as a first language by older adults only. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Aleut, Mednyj": {"name": "Aleut, Mednyj", "iso_code": "mud", "summary": "Mednyj Aleut is an extinct language of the Russian Federation. It is a mixed language.", "population": "None", "language_status": "Extinct"}, "Algerian Jewish Sign Language": {"name": "Algerian Jewish Sign Language", "iso_code": "ajs", "summary": "Algerian Jewish Sign Language is an endangered language of Israel. It is a shared sign language. The language is used as a first language by the elderly only.", "population": "None", "language_status": "Endangered"}, "Algerian Sign Language": {"name": "Algerian Sign Language", "iso_code": "asp", "summary": "Algerian Sign Language is a stable indigenous language of Algeria. It is a deaf community sign language. Direct evidence is lacking, but the language is thought to be used as a first language by deaf people of all ages.", "population": "10K to 1M", "language_status": "Stable"}, "Algonquin": {"name": "Algonquin", "iso_code": "alq", "summary": "Algonquin is an endangered indigenous language of Canada. It belongs to the Algic language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is taught as a subject of instruction in some schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Ali": {"name": "Ali", "iso_code": "aiy", "summary": "Ali is a stable indigenous language of the Central African Republic. It belongs to the Niger-Congo language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Alladian": {"name": "Alladian", "iso_code": "ald", "summary": "Alladian is a stable indigenous language of Côte d’Ivoire. It belongs to the Niger-Congo language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Allar": {"name": "Allar", "iso_code": "all", "summary": "Allar is an endangered indigenous language of India. It belongs to the Dravidian language family. The language is used as a first language by adults only. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Alngith": {"name": "Alngith", "iso_code": "aid", "summary": "Alngith is an extinct language of Australia. It belongs to the Australian language family.", "population": "None", "language_status": "Extinct"}, "Alor": {"name": "Alor", "iso_code": "aol", "summary": "Alor is a stable indigenous language of Indonesia. It belongs to the Austronesian language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Alsea": {"name": "Alsea", "iso_code": "aes", "summary": "Alsea is an extinct language of the United States. It is an unclassified language.", "population": "None", "language_status": "Extinct"}, "Alta, Northern": {"name": "Alta, Northern", "iso_code": "aqn", "summary": "Northern Alta is an endangered indigenous language of the Philippines. It belongs to the Austronesian language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Alta, Southern": {"name": "Southern Alta", "iso_code": "agy", "summary": "Southern Alta is an endangered indigenous language of the Philippines. It belongs to the Austronesian language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is used as a language of instruction in some schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Altai, Northern": {"name": "Northern Altai", "iso_code": "atv", "summary": "Northern Altai is an endangered indigenous language of the Russian Federation. It belongs to the Turkic language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Endangered"}, "Altai, Southern": {"name": "Southern Altai", "iso_code": "alt", "summary": "Southern Altai is a stable indigenous language of the Russian Federation. It belongs to the Turkic language family. The language is used as a first language by all in the ethnic community. It is taught as a subject of instruction in education.", "population": "10K to 1M", "language_status": "Institutional"}, "Alugu": {"name": "Alugu", "iso_code": "aub", "summary": "Alugu is a stable indigenous language of China. It belongs to the Sino-Tibetan language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Alune": {"name": "Alune", "iso_code": "alp", "summary": "Alune is an endangered indigenous language of Indonesia. It belongs to the Austronesian language family. Direct evidence is lacking, but the language is thought to be used as a first language by a decreasing number of young people. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Endangered"}, "Aluo": {"name": "Aluo", "iso_code": "yna", "summary": "Aluo is an endangered indigenous language of China. It belongs to the Sino-Tibetan language family. Direct evidence is lacking, but the language is thought to be used as a first language by adults only. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Endangered"}, "Alur": {"name": "Alur", "iso_code": "alz", "summary": "Alur is a stable indigenous language of the Democratic Republic of the Congo and Uganda. It belongs to the Nilo-Saharan language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is used as a language of instruction in some schools.", "population": "1M to 1B", "language_status": "Institutional"}, "Alutor": {"name": "Alutor", "iso_code": "alr", "summary": "Alutor is an endangered indigenous language of the Russian Federation. It belongs to the Chukotko-Kamchatkan language family. The language is used as a first language by the elderly only. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Alviri-Vidari": {"name": "Alviri-Vidari", "iso_code": "avd", "summary": "Alviri-Vidari is an endangered indigenous language of Iran. It belongs to the Indo-European language family. Direct evidence is lacking, but the language is thought to be used as a first language by adults only. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Alyawarr": {"name": "Alyawarr", "iso_code": "aly", "summary": "Alyawarr is an endangered indigenous language of Australia. It belongs to the Australian language family. The language is used as a first language by some people in every generation of the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Ama": {"name": "Ama", "iso_code": "nyi", "summary": "Ama is a stable indigenous language of Sudan. It belongs to the Nilo-Saharan language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Amahai": {"name": "Amahai", "iso_code": "amq", "summary": "Amahai is an endangered indigenous language of Indonesia. It belongs to the Austronesian language family. Direct evidence is lacking, but the language is thought to be used as a first language by the elderly only. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Amahuaca": {"name": "Amahuaca", "iso_code": "amc", "summary": "Amahuaca is an endangered indigenous language of Peru and Brazil. It belongs to the Panoan language family. The language is used as a first language by adults only. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Amaimon": {"name": "Amaimon", "iso_code": "ali", "summary": "Amaimon is a stable indigenous language of Papua New Guinea. It belongs to the Trans-New Guinea language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Amako": {}, "Amal": {"name": "Amal", "iso_code": "aad", "summary": "Amal is a stable indigenous language of Papua New Guinea. It belongs to the Sepik language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Amam": {"name": "Amam", "iso_code": "wer", "summary": "Amam is a stable indigenous language of Papua New Guinea. It belongs to the Trans-New Guinea language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Amami Koniya Sign Language": {"name": "Amami Koniya Sign Language", "iso_code": "jks", "summary": "Amami Koniya Sign Language is an endangered indigenous language of Japan. It is a shared sign language. The language is used as a first language by older adults only.", "population": "None", "language_status": "Endangered"}, "Amami-Oshima, Northern": {"name": "Amami-Oshima, Northern", "iso_code": "ryn", "summary": "Northern Amami-Oshima is an endangered indigenous language of Japan. It belongs to the Japonic language family. The language is used as a first language by adults only. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Endangered"}, "Amami-Oshima, Southern": {"name": "Amami-Oshima, Southern", "iso_code": "ams", "summary": "Southern Amami-Oshima is an endangered indigenous language of Japan. It belongs to the Japonic language family. The language is used as a first language by adults only. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Amanab": {}, "Amanayé": {"name": "Amanayé", "iso_code": "ama", "summary": "Amanayé is a dormant language of Brazil. It belongs to the Tupian language family. The language is no longer used as a first language by any remaining members of the ethnic community. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Amara": {}, "Amarakaeri": {"name": "Amarakaeri", "iso_code": "amr", "summary": "Amarakaeri is an endangered indigenous language of Peru. It belongs to the Harákmbut language family. Direct evidence is lacking, but the language is thought to be used as a first language by a decreasing number of young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Amarasi": {"name": "Amarasi", "iso_code": "aaz", "summary": "Amarasi is a stable indigenous language of Indonesia. It belongs to the Austronesian language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Amba": {}, "Ambae, East": {"name": "East Ambae", "iso_code": "omb", "summary": "East Ambae is a stable indigenous language of Vanuatu. It belongs to the Austronesian language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Ambae, West": {"name": "West Ambae", "iso_code": "nnd", "summary": "West Ambae is a stable indigenous language of Vanuatu. It belongs to the Austronesian language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Ambai": {"name": "Ambai", "iso_code": "amk", "summary": "Ambai is an endangered indigenous language of Indonesia. It belongs to the Austronesian language family. Direct evidence is lacking, but the language is thought to be used as a first language by a decreasing number of young people. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Endangered"}, "Ambakich": {"name": "Ambakich", "iso_code": "aew", "summary": "Ambakich is an endangered indigenous language of Papua New Guinea. It belongs to the Ramu-Lower Sepik language family. The language is used as a first language by adults only. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Ambel": {"name": "Ambel", "iso_code": "wgo", "summary": "Ambel is an endangered indigenous language of Indonesia. It belongs to the Austronesian language family. The language is used as a first language by adults only. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Ambelau": {"name": "Ambelau", "iso_code": "amv", "summary": "Ambelau is an endangered indigenous language of Indonesia. It belongs to the Austronesian language family. Direct evidence is lacking, but the language is thought to be used as a first language by a decreasing number of young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Ambele": {"name": "Ambele", "iso_code": "ael", "summary": "Ambele is a stable indigenous language of Cameroon. It belongs to the Niger-Congo language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Amblong": {"name": "Amblong", "iso_code": "alm", "summary": "Amblong is an endangered indigenous language of Vanuatu. It belongs to the Austronesian language family. The language is used as a first language by some people in every generation of the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Ambo": {"name": "Ambo", "iso_code": "amb", "summary": "Ambo is an endangered indigenous language of Nigeria. It belongs to the Niger-Congo language family. Direct evidence is lacking, but the language is thought to be used as a first language by a decreasing number of young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Ambrak": {"name": "Ambrak", "iso_code": "aag", "summary": "Ambrak is an endangered indigenous language of Papua New Guinea. It belongs to the Torricelli language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Ambrym, North": {"name": "North Ambrym", "iso_code": "mmg", "summary": "North Ambrym is a stable indigenous language of Vanuatu. It belongs to the Austronesian language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is taught as a subject of instruction in some schools.", "population": "Less than 10K", "language_status": "Stable"}, "Ambrym, Southeast": {"name": "Southeast Ambrym", "iso_code": "tvk", "summary": "Southeast Ambrym is a stable indigenous language of Vanuatu. It belongs to the Austronesian language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Ambul": {"name": "Ambul", "iso_code": "apo", "summary": "Ambul is a stable indigenous language of Papua New Guinea. It belongs to the Austronesian language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Ambulas": {"name": "Ambulas", "iso_code": "abt", "summary": "Ambulas is a stable indigenous language of Papua New Guinea. It belongs to the Sepik language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Amdang": {"name": "Amdang", "iso_code": "amj", "summary": "Amdang is a stable indigenous language of Chad. It belongs to the Nilo-Saharan language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Amele": {"name": "Amele", "iso_code": "aey", "summary": "Amele is an endangered indigenous language of Papua New Guinea. It belongs to the Trans-New Guinea language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "American Sign Language": {"name": "American Sign Language", "iso_code": "ase", "summary": "American Sign Language is a stable indigenous language of the United States. It is a deaf community sign language. The language is used as a first language by deaf people of all ages.", "population": "1M to 1B", "language_status": "Stable"}, "Amharic": {"name": "Amharic", "iso_code": "amh", "summary": "Amharic is the official national language of Ethiopia. It belongs to the Afro-Asiatic language family. It is used as a language of instruction in education.", "population": "1M to 1B", "language_status": "Institutional"}, "Ami": {"name": "Ami", "iso_code": "amy", "summary": "Ami is an endangered indigenous language of Australia. It belongs to the Australian language family. Direct evidence is lacking, but the language is thought to be used as a first language by older adults only. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Amio-Gelimi": {"name": "Amio-Gelimi", "iso_code": "let", "summary": "Amio-Gelimi is a stable indigenous language of Papua New Guinea. It belongs to the Austronesian language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Amis": {"name": "Amis", "iso_code": "ami", "summary": "Amis is an endangered indigenous language of China–Taiwan. It belongs to the Austronesian language family. Direct evidence is lacking, but the language is thought to be used as a first language by a decreasing number of young people. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Endangered"}, "Amo": {"name": "Amo", "iso_code": "amo", "summary": "Amo is a stable indigenous language of Nigeria. It belongs to the Niger-Congo language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Ampanang": {"name": "Ampanang", "iso_code": "apg", "summary": "Ampanang is an endangered indigenous language of Indonesia. It belongs to the Austronesian language family. Direct evidence is lacking, but the language is thought to be used as a first language by a decreasing number of young people. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Endangered"}, "Amri Karbi": {"name": "Amri Karbi", "iso_code": "ajz", "summary": "Amri Karbi is an endangered indigenous language of India. It belongs to the Sino-Tibetan language family. The language is used as a first language by some people in every generation of the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Endangered"}, "Amto": {"name": "Amto", "iso_code": "amt", "summary": "Amto is a stable indigenous language of Papua New Guinea. It belongs to the Amto-Musan language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Amundava": {"name": "Amundava", "iso_code": "adw", "summary": "Amundava is an endangered indigenous language of Brazil. It belongs to the Tupian language family. Direct evidence is lacking, but the language is thought to be used as a first language by a decreasing number of young people. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Amurdak": {"name": "Amurdak", "iso_code": "amg", "summary": "Amurdak is an endangered indigenous language of Australia. It belongs to the Australian language family. Direct evidence is lacking, but the language is thought to be used as a first language by the elderly only. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Amuzgo, Guerrero": {"name": "Guerrero Amuzgo", "iso_code": "amu", "summary": "Guerrero Amuzgo is a stable indigenous language of Mexico. It belongs to the Otomanguean language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Amuzgo, Ipalapa": {"name": "Ipalapa Amuzgo", "iso_code": "azm", "summary": "Ipalapa Amuzgo is an endangered indigenous language of Mexico. It belongs to the Otomanguean language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Amuzgo, San Pedro Amuzgos": {"name": "San Pedro Amuzgos Amuzgo", "iso_code": "azg", "summary": "San Pedro Amuzgos Amuzgo is a stable indigenous language of Mexico. It belongs to the Otomanguean language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Anaang": {"name": "Anaang", "iso_code": "anw", "summary": "Anaang is a stable indigenous language of Nigeria. It belongs to the Niger-Congo language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "1M to 1B", "language_status": "Stable"}, "Anakalangu": {"name": "Anakalangu", "iso_code": "akg", "summary": "Anakalangu is a stable indigenous language of Indonesia. It belongs to the Austronesian language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Anal": {"name": "Anal", "iso_code": "anm", "summary": "Anal is a stable indigenous language of India. It belongs to the Sino-Tibetan language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Anam": {"name": "Anam", "iso_code": "pda", "summary": "Anam is an endangered indigenous language of Papua New Guinea. It belongs to the Trans-New Guinea language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Anambé": {"name": "Anambé", "iso_code": "aan", "summary": "Anambé is an endangered indigenous language of Brazil. It belongs to the Tupian language family. Direct evidence is lacking, but the language is thought to be used as a first language by the elderly only. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Anamuxra": {"name": "Anamuxra", "iso_code": "imi", "summary": "Anamuxra is a stable indigenous language of Papua New Guinea. It belongs to the Trans-New Guinea language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Anasi": {"name": "Anasi", "iso_code": "bpo", "summary": "Anasi is an endangered indigenous language of Indonesia. It belongs to the East Geelvink Bay language family. Direct evidence is lacking, but the language is thought to be used as a first language by a decreasing number of young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Andaandi": {"name": "Andaandi", "iso_code": "dgl", "summary": "Andaandi is an endangered indigenous language of Sudan. It belongs to the Nilo-Saharan language family. The language is used as a first language by some people in every generation of the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Endangered"}, "Andai": {"name": "Andai", "iso_code": "afd", "summary": "Andai is a stable indigenous language of Papua New Guinea. It belongs to the Arafundi language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Andajin": {"name": "Andajin", "iso_code": "ajn", "summary": "Andajin is a dormant language of Australia. It belongs to the Australian language family. The language is no longer used as a first language by any remaining members of the ethnic community. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Andaman Hindi Creole": {"name": "Andaman Hindi Creole", "iso_code": "hca", "summary": "Andaman Hindi Creole is a stable indigenous language of India. It is a Hindi-based creole. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Andaqui": {"name": "Andaqui", "iso_code": "ana", "summary": "Andaqui is a dormant language of Colombia. It belongs to the Paezan language family. The language is no longer used as a first language by any remaining members of the ethnic community. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Andarum": {"name": "Andarum", "iso_code": "aod", "summary": "Andarum is a stable indigenous language of Papua New Guinea. It belongs to the Ramu-Lower Sepik language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Andegerebinha": {"name": "Andegerebinha", "iso_code": "adg", "summary": "Andegerebinha is a dormant language of Australia. It belongs to the Australian language family. The language is no longer used as a first language by any remaining members of the ethnic community. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Andh": {"name": "Andh", "iso_code": "anr", "summary": "Andh is an endangered indigenous language of India. It belongs to the Indo-European language family. Direct evidence is lacking, but the language is thought to be used as a first language by a decreasing number of young people. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Endangered"}, "Andi": {"name": "Andi", "iso_code": "ani", "summary": "Andi is an endangered indigenous language of the Russian Federation. It belongs to the Nakh-Daghestanian language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Endangered"}, "Andio": {"name": "Andio", "iso_code": "bzb", "summary": "Andio is an endangered indigenous language of Indonesia. It belongs to the Austronesian language family. The language is used as a first language by adults only. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Andoa": {"name": "Andoa", "iso_code": "anb", "summary": "Andoa is an extinct language of Peru. It belongs to the Zaparoan language family.", "population": "None", "language_status": "Extinct"}, "Andoque": {"name": "Andoque", "iso_code": "ano", "summary": "Andoque is an endangered indigenous language of Colombia. It is an isolate that is not known to be related to any other language. The language is used as a first language by the elderly only. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Andra-Hus": {"name": "Andra-Hus", "iso_code": "anx", "summary": "Andra-Hus is a stable indigenous language of Papua New Guinea. It belongs to the Austronesian language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Aneityum": {"name": "Aneityum", "iso_code": "aty", "summary": "Aneityum is a stable indigenous language of Vanuatu. It belongs to the Austronesian language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Anem": {"name": "Anem", "iso_code": "anz", "summary": "Anem is a stable indigenous language of Papua New Guinea. It belongs to the Yele-West New Britain language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Aneme Wake": {"name": "Aneme Wake", "iso_code": "aby", "summary": "Aneme Wake is a stable indigenous language of Papua New Guinea. It belongs to the Trans-New Guinea language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Anfillo": {"name": "Anfillo", "iso_code": "myo", "summary": "Anfillo is an endangered indigenous language of Ethiopia. It belongs to the Afro-Asiatic language family. The language is used as a first language by older adults only. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Angaataha": {"name": "Angaataha", "iso_code": "agm", "summary": "Angaataha is a stable indigenous language of Papua New Guinea. It belongs to the Trans-New Guinea language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Angaité": {"name": "Angaité", "iso_code": "aqt", "summary": "Angaité is an endangered indigenous language of Paraguay. It belongs to the Mascoyan language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Angal": {"name": "Angal", "iso_code": "age", "summary": "Angal is a stable indigenous language of Papua New Guinea. It belongs to the Trans-New Guinea language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Angal Enen": {"name": "Angal Enen", "iso_code": "aoe", "summary": "Angal Enen is a stable indigenous language of Papua New Guinea. It belongs to the Trans-New Guinea language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Angal Heneng": {"name": "Angal Heneng", "iso_code": "akh", "summary": "Angal Heneng is a stable indigenous language of Papua New Guinea. It belongs to the Trans-New Guinea language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Angika": {"name": "Angika", "iso_code": "anp", "summary": "Angika is a stable indigenous language of India. It belongs to the Indo-European language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Angkamuthi": {"name": "Angkamuthi", "iso_code": "avm", "summary": "Angkamuthi is a dormant language of Australia. It belongs to the Australian language family. The language is no longer used as a first language by any remaining members of the ethnic community. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Angloromani": {"name": "Angloromani", "iso_code": "rme", "summary": "Angloromani is a stable indigenous language of the United Kingdom. It is a mixed language. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Angolar": {"name": "Angolar", "iso_code": "aoa", "summary": "Angolar is an endangered indigenous language of São Tomé e Príncipe. It is a Portuguese-based creole. The language is used as a first language by some people in every generation of the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Angor": {"name": "Angor", "iso_code": "agg", "summary": "Angor is an endangered indigenous language of Papua New Guinea. It belongs to the Senagi language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Angoram": {"name": "Angoram", "iso_code": "aog", "summary": "Angoram is a stable indigenous language of Papua New Guinea. It belongs to the Ramu-Lower Sepik language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Anguthimri": {"name": "Anguthimri", "iso_code": "awg", "summary": "Anguthimri is a dormant language of Australia. It belongs to the Australian language family. The language is no longer used as a first language by any remaining members of the ethnic community. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Anii": {"name": "Anii", "iso_code": "blo", "summary": "Anii is a stable indigenous language of Benin and Togo. It belongs to the Niger-Congo language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Animere": {"name": "Animere", "iso_code": "anf", "summary": "Animere is an endangered indigenous language of Ghana. It belongs to the Niger-Congo language family. The language is used as a first language by older adults only. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Anindilyakwa": {"name": "Anindilyakwa", "iso_code": "aoi", "summary": "Anindilyakwa is a stable indigenous language of Australia. It belongs to the Australian language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Aninka": {"name": "Aninka", "iso_code": "aqk", "summary": "Aninka is a stable indigenous language of Nigeria. It belongs to the Niger-Congo language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Anjam": {"name": "Anjam", "iso_code": "boj", "summary": "Anjam is an endangered indigenous language of Papua New Guinea. It belongs to the Trans-New Guinea language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Ankave": {"name": "Ankave", "iso_code": "aak", "summary": "Ankave is a stable indigenous language of Papua New Guinea. It belongs to the Trans-New Guinea language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Anmatyerr": {"name": "Anmatyerr", "iso_code": "amx", "summary": "Anmatyerr is a stable indigenous language of Australia. It belongs to the Australian language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Anong": {"name": "Anong", "iso_code": "nun", "summary": "Anong is an endangered indigenous language of Myanmar. It belongs to the Sino-Tibetan language family. The language is used as a first language by older adults only. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Anor": {"name": "Anor", "iso_code": "anj", "summary": "Anor is a stable indigenous language of Papua New Guinea. It belongs to the Ramu-Lower Sepik language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Anserma": {"name": "Anserma", "iso_code": "ans", "summary": "Anserma is an extinct language of Colombia. It belongs to the Paezan language family.", "population": "None", "language_status": "Extinct"}, "Ansus": {"name": "Ansus", "iso_code": "and", "summary": "Ansus is an endangered indigenous language of Indonesia. It belongs to the Austronesian language family. Direct evidence is lacking, but the language is thought to be used as a first language by a decreasing number of young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Antikarinya": {"name": "Antikarinya", "iso_code": "ant", "summary": "Antikarinya is an endangered indigenous language of Australia. It belongs to the Australian language family. Direct evidence is lacking, but the language is thought to be used as a first language by the elderly only. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Anuak": {"name": "Anuak", "iso_code": "anu", "summary": "Anuak is a stable indigenous language of South Sudan and Ethiopia. It belongs to the Nilo-Saharan language family. The language is used as a first language by all in the ethnic community. It is taught as a subject of instruction in some schools.", "population": "10K to 1M", "language_status": "Stable"}, "Anufo": {"name": "Anufo", "iso_code": "cko", "summary": "Anufo is a stable indigenous language of Ghana, Benin, and Togo. It belongs to the Niger-Congo language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Anuki": {"name": "Anuki", "iso_code": "aui", "summary": "Anuki is an endangered indigenous language of Papua New Guinea. It belongs to the Austronesian language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Anus": {"name": "Anus", "iso_code": "auq", "summary": "Anus is an endangered indigenous language of Indonesia. It belongs to the Austronesian language family. Direct evidence is lacking, but the language is thought to be used as a first language by adults only. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Anuta": {"name": "Anuta", "iso_code": "aud", "summary": "Anuta is an endangered indigenous language of the Solomon Islands. It belongs to the Austronesian language family. The language is used as a first language by the elderly only. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Anyin": {"name": "Anyin", "iso_code": "any", "summary": "Anyin is a stable indigenous language of Côte d’Ivoire and Ghana. It belongs to the Niger-Congo language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "1M to 1B", "language_status": "Stable"}, "Anyin Morofo": {"name": "Anyin Morofo", "iso_code": "mtb", "summary": "Anyin Morofo is a stable indigenous language of Côte d’Ivoire. It belongs to the Niger-Congo language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Aoheng": {"name": "Aoheng", "iso_code": "pni", "summary": "Aoheng is an endangered indigenous language of Indonesia. It belongs to the Austronesian language family. Direct evidence is lacking, but the language is thought to be used as a first language by a decreasing number of young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Aore": {"name": "Aore", "iso_code": "aor", "summary": "Aore is an extinct language of Vanuatu. It belongs to the Austronesian language family.", "population": "None", "language_status": "Extinct"}, "Ap Ma": {"name": "Ap Ma", "iso_code": "kbx", "summary": "Ap Ma is a stable indigenous language of Papua New Guinea. It belongs to the Ramu-Lower Sepik language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Apache, Jicarilla": {"name": "Jicarilla Apache", "iso_code": "apj", "summary": "Jicarilla Apache is an endangered indigenous language of the United States. It belongs to the Eyak-Athabaskan language family. Direct evidence is lacking, but the language is thought to be used as a first language by adults only. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Apache, Kiowa": {"name": "Apache, Kiowa", "iso_code": "apk", "summary": "Kiowa Apache is a dormant language of the United States. It belongs to the Eyak-Athabaskan language family. The language is no longer used as a first language by any remaining members of the ethnic community. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Apache, Lipan": {"name": "Apache, Lipan", "iso_code": "apl", "summary": "Lipan Apache is a dormant language of the United States. It belongs to the Eyak-Athabaskan language family. The language is no longer used as a first language by any remaining members of the ethnic community. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Apache, Mescalero-Chiricahua": {"name": "Mescalero-Chiricahua Apache", "iso_code": "apm", "summary": "Mescalero-Chiricahua Apache is an endangered indigenous language of the United States. It belongs to the Eyak-Athabaskan language family. The language is used as a first language by older adults only. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Apache, Western": {"name": "Western Apache", "iso_code": "apw", "summary": "Western Apache is an endangered indigenous language of the United States. It belongs to the Eyak-Athabaskan language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Endangered"}, "Apal": {"name": "Apal", "iso_code": "ena", "summary": "Apal is an endangered indigenous language of Papua New Guinea. It belongs to the Trans-New Guinea language family. The language is used as a first language by adults only. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Apalachee": {"name": "Apalachee", "iso_code": "xap", "summary": "Apalachee is an extinct language of the United States. It belongs to the Muskogean language family.", "population": "None", "language_status": "Extinct"}, "Apalaí": {"name": "Apalaí", "iso_code": "apy", "summary": "Apalaí is a stable indigenous language of Brazil. It belongs to the Cariban language family. The language is used as a first language by all in the ethnic community. It is used as a language of instruction in some schools.", "population": "Less than 10K", "language_status": "Stable"}, "Apatani": {"name": "Apatani", "iso_code": "apt", "summary": "Apatani is an endangered indigenous language of India. It belongs to the Sino-Tibetan language family. Direct evidence is lacking, but the language is thought to be used as a first language by a decreasing number of young people. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Endangered"}, "Apiaká": {"name": "Apiaká", "iso_code": "api", "summary": "Apiaká is a dormant language of Brazil. It belongs to the Tupian language family. The language is no longer used as a first language by any remaining members of the ethnic community. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Apinagé": {"name": "Apinagé", "iso_code": "apn", "summary": "Apinagé is a stable indigenous language of Brazil. It belongs to the Jean language family. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Apma": {"name": "Apma", "iso_code": "app", "summary": "Apma is a stable indigenous language of Vanuatu. It belongs to the Austronesian language family. The language is used as a first language by all in the ethnic community. It is taught as a subject of instruction in some schools.", "population": "10K to 1M", "language_status": "Stable"}, "Apurinã": {"name": "Apurinã", "iso_code": "apu", "summary": "Apurinã is an endangered indigenous language of Brazil. It belongs to the Maipurean language family. The language is used as a first language by some people in every generation of the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Aputai": {"name": "Aputai", "iso_code": "apx", "summary": "Aputai is an endangered indigenous language of Indonesia. It belongs to the Austronesian language family. Direct evidence is lacking, but the language is thought to be used as a first language by the elderly only. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Arabana": {"name": "Arabana", "iso_code": "ard", "summary": "Arabana is an endangered indigenous language of Australia. It belongs to the Australian language family. Direct evidence is lacking, but the language is thought to be used as a first language by the elderly only. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Arabela": {"name": "Arabela", "iso_code": "arl", "summary": "Arabela is an endangered indigenous language of Peru. It belongs to the Zaparoan language family. Direct evidence is lacking, but the language is thought to be used as a first language by older adults only. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Arabic": {"name": "Arabic", "iso_code": "ara", "summary": "Arabic is classified as a “macrolanguage” in the ISO 639 standard and is assigned to [ara] as its three-letter code. Macrolanguages were introduced into the standard in order to reconcile the fact that in some usage contexts the entity represented by the three-letter code is deemed to be a single language, while in other usage contexts it is subdivided into two or more individual languages, each of which has its own code. The individual languages that make up this macrolanguage are listed below.", "language_status": "Unknown"}, "Arabic, Algerian": {"name": "Algerian Arabic", "iso_code": "arq", "summary": "Algerian Arabic is a language of wider communication that originated in Algeria. It belongs to the Afro-Asiatic language family and is part of the Arabic macrolanguage. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "1M to 1B", "language_status": "Institutional"}, "Arabic, Algerian Saharan": {"name": "Arabic, Algerian Saharan", "iso_code": "aao", "summary": "Algerian Saharan Arabic is a stable indigenous language of Algeria. It belongs to the Afro-Asiatic language family and is part of the Arabic macrolanguage. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Arabic, Baharna": {"name": "Baharna Arabic", "iso_code": "abv", "summary": "Baharna Arabic is a language of wider communication that originated in Bahrain and Saudi Arabia. It belongs to the Afro-Asiatic language family and is part of the Arabic macrolanguage. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Institutional"}, "Arabic, Chadian": {"name": "Chadian Arabic", "iso_code": "shu", "summary": "Chadian Arabic is a language of wider communication that originated in Chad, Cameroon, Niger, and Nigeria. It belongs to the Afro-Asiatic language family and is part of the Arabic macrolanguage. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is taught as a subject of instruction in education.", "population": "1M to 1B", "language_status": "Institutional"}, "Arabic, Cypriot": {"name": "Cypriot Arabic", "iso_code": "acy", "summary": "Cypriot Arabic is an endangered indigenous language of Cyprus. It belongs to the Afro-Asiatic language family and is part of the Arabic macrolanguage. The language is used as a first language by adults only. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Arabic, Dhofari": {"name": "Arabic, Dhofari", "iso_code": "adf", "summary": "Dhofari Arabic is a stable indigenous language of Oman. It belongs to the Afro-Asiatic language family and is part of the Arabic macrolanguage. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Arabic, Eastern Egyptian Bedawi": {"name": "Eastern Egyptian Bedawi Arabic", "iso_code": "avl", "summary": "Eastern Egyptian Bedawi Arabic is a stable indigenous language of Egypt, Jordan, and Palestine. It belongs to the Afro-Asiatic language family and is part of the Arabic macrolanguage. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "1M to 1B", "language_status": "Stable"}, "Arabic, Egyptian": {"name": "Egyptian Arabic", "iso_code": "arz", "summary": "Egyptian Arabic is a language of wider communication that originated in Egypt. It belongs to the Afro-Asiatic language family and is part of the Arabic macrolanguage. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "1M to 1B", "language_status": "Institutional"}, "Arabic, Gulf": {"name": "Gulf Arabic", "iso_code": "afb", "summary": "Gulf Arabic is a language of wider communication that originated in Kuwait, Iraq, Qatar, and Saudi Arabia. It belongs to the Afro-Asiatic language family and is part of the Arabic macrolanguage. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "1M to 1B", "language_status": "Institutional"}, "Arabic, Hadrami": {"name": "Arabic, Hadrami", "iso_code": "ayh", "summary": "Hadrami Arabic is a stable indigenous language of Yemen. It belongs to the Afro-Asiatic language family and is part of the Arabic macrolanguage. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "1M to 1B", "language_status": "Stable"}, "Arabic, Hijazi": {"name": "Arabic, Hijazi", "iso_code": "acw", "summary": "Hijazi Arabic is a stable indigenous language of Saudi Arabia. It belongs to the Afro-Asiatic language family and is part of the Arabic macrolanguage. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "1M to 1B", "language_status": "Stable"}, "Arabic, Juba": {"name": "Juba Arabic", "iso_code": "pga", "summary": "Juba Arabic is a language of wider communication that originated in South Sudan. It is an Arabic-based creole and is part of the Arabic macrolanguage. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "1M to 1B", "language_status": "Institutional"}, "Arabic, Judeo-Iraqi": {"name": "Arabic, Judeo-Iraqi", "iso_code": "yhd", "summary": "Judeo-Iraqi Arabic is an endangered indigenous language of Israel. It belongs to the Afro-Asiatic language family and is part of the Judeo-Arabic macrolanguage. The language is used as a first language by adults only. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Endangered"}, "Arabic, Judeo-Moroccan": {"name": "Arabic, Judeo-Moroccan", "iso_code": "aju", "summary": "Judeo-Moroccan Arabic is an endangered indigenous language of Morocco. It belongs to the Afro-Asiatic language family and is part of the Judeo-Arabic macrolanguage. The language is used as a first language by adults only. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Endangered"}, "Arabic, Judeo-Tripolitanian": {"name": "Arabic, Judeo-Tripolitanian", "iso_code": "yud", "summary": "Judeo-Tripolitanian Arabic is an endangered indigenous language of Israel. It belongs to the Afro-Asiatic language family and is part of the Judeo-Arabic macrolanguage. The language is used as a first language by adults only. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Endangered"}, "Arabic, Judeo-Yemeni": {"name": "Arabic, Judeo-Yemeni", "iso_code": "jye", "summary": "Judeo-Yemeni Arabic is an endangered indigenous language of Yemen. It belongs to the Afro-Asiatic language family and is part of the Judeo-Arabic macrolanguage. Direct evidence is lacking, but the language is thought to be used as a first language by older adults only. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Arabic, Levantine": {"name": "Levantine Arabic", "iso_code": "apc", "summary": "Levantine Arabic is a language of wider communication that originated in Syria, Israel, Jordan, Lebanon, Palestine, and Turkey. It belongs to the Afro-Asiatic language family and is part of the Arabic macrolanguage. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "1M to 1B", "language_status": "Institutional"}, "Arabic, Libyan": {"name": "Libyan Arabic", "iso_code": "ayl", "summary": "Libyan Arabic is a language of wider communication that originated in Libya, Egypt, and Niger. It belongs to the Afro-Asiatic language family and is part of the Arabic macrolanguage. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "1M to 1B", "language_status": "Institutional"}, "Arabic, Mesopotamian": {"name": "Mesopotamian Arabic", "iso_code": "acm", "summary": "Mesopotamian Arabic is a language of wider communication that originated in Iraq, Iran, and Syria. It belongs to the Afro-Asiatic language family and is part of the Arabic macrolanguage. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "1M to 1B", "language_status": "Institutional"}, "Arabic, Moroccan": {"name": "Moroccan Arabic", "iso_code": "ary", "summary": "Moroccan Arabic is a language of wider communication that originated in Morocco and Western Sahara. It belongs to the Afro-Asiatic language family and is part of the Arabic macrolanguage. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "1M to 1B", "language_status": "Institutional"}, "Arabic, Najdi": {"name": "Najdi Arabic", "iso_code": "ars", "summary": "Najdi Arabic is a language of wider communication that originated in Saudi Arabia, Iraq, Jordan, and Syria. It belongs to the Afro-Asiatic language family and is part of the Arabic macrolanguage. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "1M to 1B", "language_status": "Institutional"}, "Arabic, North Mesopotamian": {"name": "North Mesopotamian Arabic", "iso_code": "ayp", "summary": "North Mesopotamian Arabic is a stable indigenous language of Iraq, Syria, and Turkey. It belongs to the Afro-Asiatic language family and is part of the Arabic macrolanguage. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "1M to 1B", "language_status": "Stable"}, "Arabic, Omani": {"name": "Omani Arabic", "iso_code": "acx", "summary": "Omani Arabic is a stable indigenous language of Oman. It belongs to the Afro-Asiatic language family and is part of the Arabic macrolanguage. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "1M to 1B", "language_status": "Stable"}, "Arabic, Sa’idi": {"name": "Arabic, Sa’idi", "iso_code": "aec", "summary": "Sa’idi Arabic is a stable indigenous language of Egypt. It belongs to the Afro-Asiatic language family and is part of the Arabic macrolanguage. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "1M to 1B", "language_status": "Stable"}, "Arabic, Sanaani": {"name": "Sanaani Arabic", "iso_code": "ayn", "summary": "Sanaani Arabic is a stable indigenous language of Yemen. It belongs to the Afro-Asiatic language family and is part of the Arabic macrolanguage. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "1M to 1B", "language_status": "Stable"}, "Arabic, Shihhi": {"name": "Arabic, Shihhi", "iso_code": "ssh", "summary": "Shihhi Arabic is a stable indigenous language of the United Arab Emirates, Iran, and Oman. It belongs to the Afro-Asiatic language family and is part of the Arabic macrolanguage. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Arabic, Standard": {"name": "Standard Arabic", "iso_code": "arb", "summary": "Standard Arabic is an international language whose original homeland was in Saudi Arabia. It belongs to the Afro-Asiatic language family and is part of the Arabic macrolanguage. It is used as a language of instruction in education.", "population": "1M to 1B", "language_status": "Institutional"}, "Arabic, Sudanese": {"name": "Sudanese Arabic", "iso_code": "apd", "summary": "Sudanese Arabic is a language of wider communication that originated in Sudan and South Sudan. It belongs to the Afro-Asiatic language family and is part of the Arabic macrolanguage. The language is used as a first language by all in the ethnic community. It is taught as a subject of instruction in education.", "population": "1M to 1B", "language_status": "Institutional"}, "Arabic, Ta’izzi-Adeni": {"name": "Arabic, Ta’izzi-Adeni", "iso_code": "acq", "summary": "Ta’izzi-Adeni Arabic is a stable indigenous language of Yemen. It belongs to the Afro-Asiatic language family and is part of the Arabic macrolanguage. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "1M to 1B", "language_status": "Institutional"}, "Arabic, Tajiki": {"name": "Arabic, Tajiki", "iso_code": "abh", "summary": "Tajiki Arabic is an endangered indigenous language of Tajikistan and Afghanistan. It belongs to the Afro-Asiatic language family and is part of the Arabic macrolanguage. Direct evidence is lacking, but the language is thought to be used as a first language by a decreasing number of young people. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Endangered"}, "Arabic, Tunisian": {"name": "Tunisian Arabic", "iso_code": "aeb", "summary": "Tunisian Arabic is a language of wider communication that originated in Tunisia. It belongs to the Afro-Asiatic language family and is part of the Arabic macrolanguage. Direct evidence is lacking, but the language is thought to be used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "1M to 1B", "language_status": "Institutional"}, "Arabic, Uzbeki": {"name": "Arabic, Uzbeki", "iso_code": "auz", "summary": "Uzbeki Arabic is an endangered indigenous language of Uzbekistan and Iran. It belongs to the Afro-Asiatic language family and is part of the Arabic macrolanguage. Direct evidence is lacking, but the language is thought to be used as a first language by older adults only. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Aragonese": {"name": "Aragonese", "iso_code": "arg", "summary": "Aragonese is an endangered indigenous language of Spain. It belongs to the Indo-European language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Endangered"}, "Arakwal": {"name": "Arakwal", "iso_code": "rkw", "summary": "Arakwal is an extinct language of Australia. It belongs to the Australian language family.", "population": "None", "language_status": "Extinct"}, "Aralle-Tabulahan": {"name": "Aralle-Tabulahan", "iso_code": "atq", "summary": "Aralle-Tabulahan is a stable indigenous language of Indonesia. It belongs to the Austronesian language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}, "Aramba": {"name": "Aramba", "iso_code": "stk", "summary": "Aramba is a stable indigenous language of Papua New Guinea. It belongs to the South-Central Papuan language family. The language is used as a first language by all in the ethnic community. It is used as a language of instruction in education.", "population": "Less than 10K", "language_status": "Institutional"}, "Aranadan": {"name": "Aranadan", "iso_code": "aaf", "summary": "Aranadan is an endangered indigenous language of India. It belongs to the Dravidian language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Aranama-Tamique": {"name": "Aranama-Tamique", "iso_code": "xrt", "summary": "Aranama-Tamique is an extinct language of the United States. It is an unclassified language.", "population": "None", "language_status": "Extinct"}, "Aranda, Lower Southern": {"name": "Aranda, Lower Southern", "iso_code": "axl", "summary": "Lower Southern Aranda is a dormant language of Australia. It belongs to the Australian language family. The language is no longer used as a first language by any remaining members of the ethnic community. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Arandai": {"name": "Arandai", "iso_code": "jbj", "summary": "Arandai is an endangered indigenous language of Indonesia. It belongs to the Trans-New Guinea language family. The language is used as a first language by all adults in the ethnic community, but not all young people. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Araona": {"name": "Araona", "iso_code": "aro", "summary": "Araona is an endangered indigenous language of Bolivia. It belongs to the Tacanan language family. The language is used as a first language by some people in every generation of the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Arapaho": {"name": "Arapaho", "iso_code": "arp", "summary": "Arapaho is an endangered indigenous language of the United States. It belongs to the Algic language family. The language is used as a first language by older adults only. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Arapaso": {"name": "Arapaso", "iso_code": "arj", "summary": "Arapaso is a dormant language of Brazil. It belongs to the Tucanoan language family. The language is no longer used as a first language by any remaining members of the ethnic community. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Arára, Mato Grosso": {"name": "Arára, Mato Grosso", "iso_code": "axg", "summary": "Mato Grosso Arára is a dormant language of Brazil. It is an unclassified language. The language is no longer used as a first language by any remaining members of the ethnic community. It is not known to be taught in schools.", "population": "None", "language_status": "Endangered"}, "Arara, Pará": {"name": "Pará Arara", "iso_code": "aap", "summary": "Pará Arara is an endangered indigenous language of Brazil. It belongs to the Cariban language family. The language is used as a first language by adults only. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Ararandewára": {"name": "Ararandewára", "iso_code": "xaj", "summary": "Ararandewára is an extinct language of Brazil. It belongs to the Tupian language family.", "population": "None", "language_status": "Extinct"}, "Arawak": {"name": "Arawak", "iso_code": "arw", "summary": "Arawak is an endangered indigenous language of Suriname and French Guiana. It belongs to the Maipurean language family. The language is used as a first language by older adults only. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Endangered"}, "Araweté": {"name": "Araweté", "iso_code": "awt", "summary": "Araweté is a stable indigenous language of Brazil. It belongs to the Tupian language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "Less than 10K", "language_status": "Stable"}, "Arbore": {"name": "Arbore", "iso_code": "arv", "summary": "Arbore is a stable indigenous language of Ethiopia. It belongs to the Afro-Asiatic language family. The language is used as a first language by all in the ethnic community. It is not known to be taught in schools.", "population": "10K to 1M", "language_status": "Stable"}}